<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"7e4caec5c2f48ec5c00d9eef8a03cd7c948e518a8bef65dc8562908ac39b44a8","plan_job_ref":"Job Staging Image Build & Push #27 at https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7328887234","plan_hash":"87de111293e406d63e38845f03510d47b1888cc29dbcbb224514b6bf9e0c66e1","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 2 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_cluster.fastapi-cluster must be replaced
-/+ resource "aws_ecs_cluster" "fastapi-cluster" {
!~      arn      = "arn:aws:ecs:eu-central-1:806066816337:cluster/fastapi-cluster" -> (known after apply)
!~      id       = "*************************************************************" -> (known after apply)
!~      name     = "fastapi-cluster" -> "dev-fastapi-cluster" # forces replacement
-       tags     = {} -> null
!~      tags_all = {} -> (known after apply)

#        (1 unchanged block hidden)
    }

  # aws_ecs_service.fastapi-service will be created
+   resource "aws_ecs_service" "fastapi-service" {
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       force_new_deployment               = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "dev-fastapi-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = (known after apply)
+       task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-docker-image:3"
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       network_configuration {
+           assign_public_ip = true
+           security_groups  = [
+               "sg-0ac5d9e923d0871aa",
            ]
+           subnets          = (sensitive value)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Staging Image Build & Push #27](https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7328887234)